---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \\programs.ahrq.local\programs\MEPS\AHRQ4_CY2\B_CFACT\BJ001DVK\Workshop_2018_Fall\STATA\PROG\exercise2.log
  log type:  text
 opened on:  29 Aug 2018, 09:19:52

. cd \\programs.ahrq.local\programs\MEPS\AHRQ4_CY2\B_CFACT\BJ001DVK\Workshop_2018_Fall\STATA\DATA
\\programs.ahrq.local\programs\MEPS\AHRQ4_CY2\B_CFACT\BJ001DVK\Workshop_2018_Fall\STATA\DATA

. 
. // 1) identify Narcotic analgesics or Narcotic analgesic combos using therapeutic classification (tc) codes
. use dupersid rxrecidx linkidx tc1s1_1 rxxp16x rxsf16x if tc1s1_1==60 | tc1s1_1==191 using h188a

. list dupersid rxrecidx linkidx rxxp16x rxsf16x in 1/30, table

     +---------------------------------------------------------------+
     | dupersid          rxrecidx        linkidx   rxxp16x   rxsf16x |
     |---------------------------------------------------------------|
  1. | 10002101   100021010211001   100021010211     88.68         0 |
  2. | 10002101   100021010211002   100021010211     88.68         0 |
  3. | 10002101   100021010211003   100021010211     88.68         0 |
  4. | 10002101   100021010211004   100021010211     88.68         0 |
  5. | 10002101   100021010211005   100021010211     88.68         0 |
     |---------------------------------------------------------------|
  6. | 10002101   100021010211006   100021010211     88.68         0 |
  7. | 10005101   100051010091001   100051010091         5      2.31 |
  8. | 10008107   100081070091001   100081070091      6.17         0 |
  9. | 10017101   100171010031001   100171010031     14.99     14.99 |
 10. | 10019102   100191020171001   100191020171      7.59      7.59 |
     |---------------------------------------------------------------|
 11. | 10025102   100251020071001   100251020071     36.49        20 |
 12. | 10025102   100251020121001   100251020121     36.49        20 |
 13. | 10028101   100281010031001   100281010031      5.97      5.97 |
 14. | 10029101   100291010121001   100291010121      7.22       .28 |
 15. | 10029101   100291010161001   100291010161     16.84       .28 |
     |---------------------------------------------------------------|
 16. | 10029101   100291010161002   100291010161      4.81        .2 |
 17. | 10029101   100291010401001   100291010401      20.2      1.12 |
 18. | 10029101   100291010401002   100291010401      20.2      1.12 |
 19. | 10029101   100291010401003   100291010401      20.2      1.12 |
 20. | 10029101   100291010401004   100291010401      20.2      1.12 |
     |---------------------------------------------------------------|
 21. | 10029101   100291010401005   100291010401      69.9      1.12 |
 22. | 10029101   100291010401006   100291010401      69.9      1.12 |
 23. | 10029101   100291010511001   100291010511    203.99       1.2 |
 24. | 10029101   100291010761001   100291010761     15.12      1.12 |
 25. | 10029101   100291010761002   100291010761     15.12      1.12 |
     |---------------------------------------------------------------|
 26. | 10029101   100291010761003   100291010761     15.12      1.12 |
 27. | 10029101   100291010761004   100291010761     15.12      1.12 |
 28. | 10031102   100311020221001   100311020221      1.34         0 |
 29. | 10031102   100311020711001   100311020711       9.3         0 |
 30. | 10031102   100311020711002   100311020711      7.08         0 |
     +---------------------------------------------------------------+

. tab1 tc1s1_1

-> tabulation of tc1s1_1  

     multum |
  therapeut |
sub-sub-cla |
     ss for |
      tc1s1 |      Freq.     Percent        Cum.
------------+-----------------------------------
         60 |      5,420       44.98       44.98
        191 |      6,629       55.02      100.00
------------+-----------------------------------
      Total |     12,049      100.00

. 
. // 2) sum data to person-level
. sort dupersid

. by dupersid: egen tot=sum(rxxp16x)

. by dupersid: egen oop=sum(rxsf16x)

. by dupersid: gen n_purchase=_n

. 
. list dupersid n_purchase tot oop rxxp16x rxsf16x in 1/20

     +----------------------------------------------------------+
     | dupersid   n_purc~e      tot     oop   rxxp16x   rxsf16x |
     |----------------------------------------------------------|
  1. | 10002101          1   532.08       0     88.68         0 |
  2. | 10002101          2   532.08       0     88.68         0 |
  3. | 10002101          3   532.08       0     88.68         0 |
  4. | 10002101          4   532.08       0     88.68         0 |
  5. | 10002101          5   532.08       0     88.68         0 |
     |----------------------------------------------------------|
  6. | 10002101          6   532.08       0     88.68         0 |
  7. | 10005101          1        5    2.31         5      2.31 |
  8. | 10008107          1     6.17       0      6.17         0 |
  9. | 10017101          1    14.99   14.99     14.99     14.99 |
 10. | 10019102          1     7.59    7.59      7.59      7.59 |
     |----------------------------------------------------------|
 11. | 10025102          1    72.98      40     36.49        20 |
 12. | 10025102          2    72.98      40     36.49        20 |
 13. | 10028101          1     5.97    5.97      5.97      5.97 |
 14. | 10029101          1   513.94   13.16      7.22       .28 |
 15. | 10029101          2   513.94   13.16     16.84       .28 |
     |----------------------------------------------------------|
 16. | 10029101          3   513.94   13.16      4.81        .2 |
 17. | 10029101          4   513.94   13.16      20.2      1.12 |
 18. | 10029101          5   513.94   13.16      20.2      1.12 |
 19. | 10029101          6   513.94   13.16      20.2      1.12 |
 20. | 10029101          7   513.94   13.16      20.2      1.12 |
     +----------------------------------------------------------+

. 
. by dupersid: keep if _n==_N
(8,795 observations deleted)

. gen third_payer   = tot - oop

. 
. // 3) merge the person-level expenditures to the fy puf 
. tempfile perdrug

. save "`perdrug'"
file C:\Users\CYu\AppData\Local\Temp\ST_00000001.tmp saved

. 
. use dupersid varstr varpsu perwt16f using h192

. sort dupersid

. 
. merge 1:m dupersid using "`perdrug'", keep(master matches)

    Result                           # of obs.
    -----------------------------------------
    not matched                        31,401
        from master                    31,401  (_merge==1)
        from using                          0  (_merge==2)

    matched                             3,254  (_merge==3)
    -----------------------------------------

. *tabmiss  n_purchase tot oop third_payer
. 
. gen sub=(_merge==3)

. tab sub

        sub |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,401       90.61       90.61
          1 |      3,254        9.39      100.00
------------+-----------------------------------
      Total |     34,655      100.00

. 
. recode n_purchase tot oop third_payer (missing=0)
(n_purchase: 31401 changes made)
(tot: 31401 changes made)
(oop: 31401 changes made)
(third_payer: 31401 changes made)

. sum n_purchase tot oop third_payer if sub==0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  n_purchase |     31,401           0           0          0          0
         tot |     31,401           0           0          0          0
         oop |     31,401           0           0          0          0
 third_payer |     31,401           0           0          0          0

. 
.  keep if perwt16f>0
(1,396 observations deleted)

. // 4) calculate estimates on expenditures and use
. svyset [pweight= perwt16f], strata( varstr) psu(varpsu) vce(linearized) singleunit(missing)

      pweight: perwt16f
          VCE: linearized
  Single unit: missing
     Strata 1: varstr
         SU 1: varpsu
        FPC 1: <zero>

. 
. svy, subpop(sub): mean n_purchase tot oop third_payer, cformat(%8.3g)
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     165      Number of obs   =       33,259
Number of PSUs   =     368      Population size =  323,141,687
                                Subpop. no. obs =        3,175
                                Subpop. size    = 34,060,347.2
                                Design df       =          203

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
  n_purchase |       3.57      .0958          3.38        3.76
         tot |        239       19.3           201         277
         oop |       41.8       3.78          34.3        49.2
 third_payer |        197       18.2           161         233
--------------------------------------------------------------

. svy, subpop(sub): total n_purchase tot oop third_payer
(running total on estimation sample)

Survey: Total estimation

Number of strata =     165      Number of obs   =       33,259
Number of PSUs   =     368      Population size =  323,141,687
                                Subpop. no. obs =        3,175
                                Subpop. size    = 34,060,347.2
                                Design df       =          203

--------------------------------------------------------------
             |             Linearized
             |      Total   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
  n_purchase |   1.22e+08    4928822      1.12e+08    1.31e+08
         tot |   8.13e+09   6.80e+08      6.79e+09    9.47e+09
         oop |   1.42e+09   1.41e+08      1.14e+09    1.70e+09
 third_payer |   6.71e+09   6.29e+08      5.47e+09    7.95e+09
--------------------------------------------------------------

. estimates table, b(%13.0f) se(%11.0f)

------------------------------
    Variable |    active      
-------------+----------------
  n_purchase |     121674856  
             |       4928822  
         tot |    8131321787  
             |     680339811  
         oop |    1422839747  
             |     141147574  
 third_payer |    6708482021  
             |     629279338  
------------------------------
                  legend: b/se

. 
. log close  
      name:  <unnamed>
       log:  \\programs.ahrq.local\programs\MEPS\AHRQ4_CY2\B_CFACT\BJ001DVK\Workshop_2018_Fall\STATA\PROG\exercise2.log
  log type:  text
 closed on:  29 Aug 2018, 09:19:54
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
